/*

再见,2020！！！

鼠年已悄然离去,

这一年很慢,又很快。日历的最后一页撕下,钟表又回到了起点,已不是昔年。往后的日子都是崭新的。

可回味,切不可留恋。前路浩浩荡荡,万事尽可期待。

道2020,春夏秋冬,忆往昔。

本该在欢声笑语中度过的2020年春节,因疫情而变得不同寻常。

中国,这个有凝聚力的国度,慌而不乱的告诉世界：华夏儿女在巨浪中,砥砺前行,载入历史涛声。

2020今年总共的读书量是12本,略有心得体会。

《干法》-----稻盛和夫
   Note：在拓展人生可能性的领域时,必须具备指引方向的指南针,借以坚定前行的信心,假以时日,必感重生。
       
《牛虻》-----艾婕尔·丽莲·伏尼契
   Note：亚瑟,背叛了他曾笃信的上帝,投入了火热革命的斗争,饱受摧残和压迫,锤炼成为统一和独立意大利而忘我战斗的革命者。So---村里青年,需要有一股力量,迎各种难。
   
《斯通纳》-----约翰·威廉斯
   Note:这本迟到已久的经典,灰暗的此书,细细品出那一份精彩。这本书也让我看清楚,很多事情,并不需要合适的契机,想做尽快去做,也许很多人告诉你,你这样做并不合适,你只需要做出来,想太多而不去行动,只是徘徊,永远很难做成一件事。
        
《岛上书店》-----加布瑞埃拉·泽文
   Note："We aren't the things we collect, acquire, read. We are, for as long as we are here,
         only love. The things we loved. The people we loved. And these, I think these really do live on." 
         “我们不是我们所收集的、得到的、所读的东西,只要我们还活着,我们就是爱,我们所爱的事物,
         我们所爱的人。所有这些,我认为真的会存活下去。”
         有时我读书,因为我孤单。读着读着,然后就不孤单。每本书都是一个世界。

《哲学的故事》-----威尔·杜兰特
   Note：哲学是什么？我没有找到答案,也许没有答案,但希腊古城德尔菲的阿波罗神庙上刻着两句毫无激情的话尤其深刻："gnothi seauton(认识你自己) 和 meden agan(凡事勿过度)"

《爱的博弈》-----约翰·戈特曼   娜恩·西尔弗
   Note: （对此书译名个人不太喜欢）本书并不是让爱的双方博弈。其中包含：选择,情绪,信任,理解,思维模式。可意会,不言传。此书还需多读。方可大成,羽化登仙！！！

关于工作：在项目上整体还算满意,没捅什么大篓子,但小问题很多,基本都是因为自己粗心导致花成倍的时间去解决问题！

          存在的问题：
                     1.工作学习时紧时松,不够扎实,工作取得成绩后有自满的心理。
                     2.有时会存在我以为可以的思想,严谨度不足。
          解决：时刻保持清晰思路,研发产品来不得半点懈怠。以谦卑的态度面对工作。
                使用Notion软件,每天工作的开始,记录工作事项和注意事项,提高生产力,避免犯错。

关于自己：2020是来到上海的第二年,明白了：生下来活下去,生活不容易,但快乐很重要,。
年
          2020年年中,时常处于一个超高负荷的工作中,提前的消耗自己,让自己长期处于疲态。
          
          So下半年今年去了2个地方：
          
            1：我+狗哥+胖弟弟自驾游乌镇、浙西大龙湾、千岛湖(全程来回800多公里):浙西大龙湾驶入千岛湖的国道，
               丛山峻岭,蜿蜒崎岖。在大山深缓缓前行,大自然尽收眼底,美不胜收。在那心旷神怡的时刻。pa~吱~~~前左胎漏气,
               吭呲吭呲换备胎,可是心酸。这也不乏是段有趣的回忆。千岛湖的鱼好香。🙂----千岛湖很美。
               
            2: 我+二弟自驾西递宏村---登黄山！刚好遇到宏村花田盛开、山中日落,晚间和二弟在清吧,喝杯小酒，听了几首歌,
               万万没想到夜里好冷。二弟言:"大哥,没有感觉有一丢冷"。我:"我是一点都不冷,就是有点抖"😄。
               登黄山那日,山间小雨不断。午时征服皖南第一高峰‘莲花峰’ 高程：1864.8米，抵达光明顶时因疫情不可租帐篷,
               且预报明日小雨，无日出（小声：酒店一晚800+太贵😭）。撤退返回宏村。----黄山它日必再攀登！
          
           旅游是给自己最珍贵的思量：当放下工作时,感受生活带来的美好时,才会对生活有启发,反过来也有易于提高工作。
           
          2021年：坐上绿皮车咯吱咯吱摇向川西---西藏(计划备忘录中) 
           
          2020作息时间：周一到周五：8:00--17:00正常上下班时间,地铁往返3小时：早高峰新闻时间----
                                    晚上下班地铁时间（上班一天有些许疲态,看看书,和朋友聊聊天。
                                    这几天认识了佳佳老师,感谢这几天下班路上陪唠嗑,回头南丰请你吃炒米粉😜）
                                    
                        周末：7:40起床---8:30之前吃好早饭,做好一天的工作和生活事项。投入工作到11：30
                              下午午休,处理个人事情+篮球时间,晚上8:00-10:00工作学习时间。
                              
                       （2021年继续保持,若有更好的时间安排可进行调整。）

          三年前染上吸烟的恶习,肺活量下降,咳嗽略微增加,2020年12月1日至今戒烟已30天,加强锻炼,2021备战西藏！(健康重要)

关于爱情：2020年6月,和土豆达成一致,和平分手。恋爱两年她在浙江我在上海,因为上半年家里催她结婚。她想在杭州买房。
          我单亲家庭,家里并不富裕,父亲在家种果树也只够自己一年开销,刚来上海工作两年没多少存款,
          在杭州买房买车目前的我无法承担的起。
          那个周末我来到她的城市,聊了很久,才知道她在家这段日子的煎熬,她父母反对我们在一起帮他四处找对象。
          当时我想争取,想问她,可以晚两年吗？
          看着她恍惚的神情,我似乎知道了什么,我也想了杭州这样的大城市两年也许不够,我放弃了挣扎,我们提出和平分手,她也同意了。
          那是我第一次看她哭的那么厉害,我打电话叫她弟弟,把她接回去了。至今不在联系！！！
          土豆是一个好女孩,希望你过的好,愿你岁月无波澜。
          
         在之后两个月的时间里,用工作麻木自己,不让自己的思维停顿下来。9月的一天在书店看到《爱的博弈》这本书,这本书让我清醒。
         现实就是如此,试着去体会她感受,当给不了她想要的安全感时,那就放弃,对彼此都好。不如姿态好看些,往后还有无限的可能性。
         过去的都已然过去,把它当作人生中重要的一课,热情出发。
         依然去追寻下一份爱情,在她没来之前,你要努力变好,当她来时,她会很好,你也不差。
         往后的生活,不可耗子尾汁,努力挣钱,但还是要提高生活的质量,让自己成为一个有趣的人😜。
Ending


你好2021☀ ！！！！
     
     计划：
           1.常联系家人,一周不少于2次！
           2.最少12本书的阅读量！
           3.学会弹吉他,那把生锈的吉他🎸得见见光！
           4.咯吱咯吱去一趟西藏（视国内疫情而定）！
           5.掌握全新Verilog语言做FPGA开发！
           6.可能计划.............(待定)！！！
           

 
         
          

























































/*
